## Website CMS
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
common_variables.tf
logging.tf
networking.tf
security-groups.tf
```



**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cms_app will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cms_app"  {
      ~ id       = "b195d904d786995892ade50df1aea9d0b6e1b4c9c9f6fe218bd71915e17e16b3" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "AWS_ACCESS_KEY_ID"
                          - value = "AKIA3ILMKXZAQKCHMJ5Z"
                        },
                      - {
                          - name  = "AWS_SECRET_ACCESS_KEY"
                          - value = "lXMFswGJPqu6QFBl+FqlUWyvH/marUWoFiTrjbmj"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                      - {
                          - name  = "DATABASE_PASSWORD"
                          - value = "Mb44AKnorh2dDyXL708GI"
                        },
                      - {
                          - name  = "TOKEN"
                          - value = "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"
                        },
                    ]
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E3LJ122ODG3W38"
        tags                           = {}
        # (16 unchanged attributes hidden)




      ~ viewer_certificate {
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2019"
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # aws_db_instance.website-cms-database will be updated in-place
  ~ resource "aws_db_instance" "website-cms-database" {
      ~ engine_version                        = "10.18" -> "10.17"
        id                                    = "strapi"
        name                                  = "strapi"
        tags                                  = {
            "CostCenter" = "website-cms"
            "Name"       = "website-cms-database"
        }
        # (43 unchanged attributes hidden)
    }

  # aws_ecs_service.website-cms-ecs will be updated in-place
  ~ resource "aws_ecs_service" "website-cms-ecs" {
        id                                 = "arn:aws:ecs:ca-central-1:773858180673:service/website-cms-cluster/website-cms-ecs"
        name                               = "website-cms-ecs"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:57" -> (known after apply)
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cds-website-cms must be replaced
-/+ resource "aws_ecs_task_definition" "cds-website-cms" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:48" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_ACCESS_KEY_ID"
                          - value = "AKIA3ILMKXZAQKCHMJ5Z"
                        },
                      - {
                          - name  = "AWS_SECRET_ACCESS_KEY"
                          - value = "lXMFswGJPqu6QFBl+FqlUWyvH/marUWoFiTrjbmj"
                        },
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_PASSWORD"
                          - value = "Mb44AKnorh2dDyXL708GI"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "TOKEN"
                          - value = "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"
                        },
                    ]
                  - essential        = true
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                          - hostPort      = 1337
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "website-cms-task" -> (known after apply)
      ~ revision                 = 48 -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 4, in provider "aws":
   4:   version             = "~> 2.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.cms-load-balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.s3_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.website-cms-database"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.image-repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.website-cms-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.website-cms-ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs-task-execution-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cw"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.website-asset-bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
